[
  {
    "title": "CEO & Founder - Light of Twelve ",
    "subtitle": "Wholesale & Retail Gemstone + Mineral Sales \n& Information Resource Platform",
    "dates": "October 2020 - Present",
    "company": "www.lightoftwelve.com",
    "bullets": [
      "Founded and have been successfully running an e-commerce business, managing all aspects from concept development, branding, and web design to supply chain management, marketing, and business operations.",
      "Transformed brand identity by designing a unique visual style, resulting in a distinctive & compelling company image.",
      "Showcased web design skills by fully redesigning the company website and migrating from Wix to Shopify for superior SEO opportunities & website performance.",
      "Optimized site performance and user experience by leveraging SEO tools like SEMrush and SurferSEO, implementing website accessibility standards, and following best UX/UI design practices.",
      "Authored engaging SEO copy for blogs, product descriptions, and marketing materials, stimulating customer engagement & organic traffic.",
      "Regularly conducted marketing analysis using Google Analytics and Google Search Console, tracking campaign effectiveness, customer behavior, and market trends, leading to data-driven strategic adjustments.",
      "Drove business growth through an innovative blend of B2B & B2C strategies, demonstrating an understanding of diverse target markets and customer needs.",
      "Leveraged dropshipping techniques using tools like Modalyst & Dsers, demonstrating versatility and adaptability in fulfillment strategies.",
      "Orchestrated product importing and exporting processes, including managing port entry collections.",
      "Successfully built and maintained strategic relationships with vendors and industry partners, managing import, export, and compliance with all relevant regulations.",
      "Developed and executed innovative marketing campaigns and public speaking events, significantly boosting long-term profitability.",
      "Demonstrated strategic financial management by overseeing all aspects, including pricing structures, budgeting, forecasting, fund seeking, & business plan writing.",
      "Exhibited effective project management and leadership skills by coordinating a team of 5 contract professionals for specialized tasks."
    ]
  },
  {
    "title": "REAL ESTATE INVESTOR",
    "subtitle": "Real Estate Acquisition & Sales",
    "dates": "Oct 2011 - Present",
    "company": "Thunder Bay, Ontario \nMississauga, Ontario",
    "bullets": [
      "Real Estate Analysis & Acquisition: Successfully spearheaded the renovation and sale of numerous properties, applying a keen eye for potential and profitable investment opportunities.",
      "Project Management: Oversaw entire renovation projects from conception to completion. This included drafting timelines, setting budgets, and coordinating and managing teams of contractors, ensuring timely and quality execution of renovation plans.",
      "Vendor Management: Fostered and maintained strategic relationships with local vendors, negotiating discounted rates for materials, significantly reducing renovation costs.",
      "Budget Management: Developed and managed project budgets, balancing the need for quality renovations with profitability targets.",
      "Profit Realization: Successfully sold all completed projects at a profit, validating the effectiveness of my project management skills and real estate acumen.",
      "Expertly networked with banking professionals to secure foreclosed homes at competitive prices, consistently optimizing investment returns.",
      "Regularly participated in city auctions, showcasing negotiation skills to acquire properties at advantageous rates.",
      "Studied and anticipated interior design and real estate market trends, enabling the rapid sale of properties due to their alignment with consumer preferences.",
      "Oversaw project budgets, permitting processes, and vendor contracts, ensuring all renovations complied with zoning laws and safety regulations.",
      "Cultivated a reputation for producing high-quality, market-ready homes that consistently exceeded buyer expectations.",
      "Demonstrated effective tenant acquisition strategies, efficiently marketing properties to suitable demographics, leading to successful tenancies.",
      "Applied robust tenant retention strategies, including responsive customer service and proactive maintenance, ensuring tenant satisfaction and a steady rental income."
    ]
  },
  {
    "title": "Spa Manager",
    "subtitle": "Merle Norman Cosmetics Studio & Day Spa",
    "dates": "Oct 2016 - Apr 2020",
    "company": "Thunder Bay, Ontario",
    "bullets": [
      "Led overall spa operations, including bookkeeping, financial management, product ordering, and creating visually appealing product displays that drove product sales.",
      "Skillfully managed the spa's finances, including budgeting, forecasting, and financial reporting, contributing to the spa's financial health and growth.",
      "Demonstrated exceptional proficiency in various spa services, ensuring client satisfaction and repeat business.",
      "Implemented comprehensive employee training programs that elevated service quality and consistency, resulting in a highly skilled and customer-centric team.",
      "Supervised a team of professionals, fostering an environment that encouraged continuous improvement, cooperation, and high morale.",
      "Directed marketing initiatives and social media management, creating compelling promotional campaigns that increased brand visibility and customer engagement.",
      "Utilized strategic client retention strategies that strengthened customer loyalty and boosted return rates, including personalized customer follow-ups and insight-driven service improvements.",
      "Managed inventory effectively, maintaining an optimal stock level that minimized waste and maximized cost efficiency.",
      "Pioneered sales and marketing strategies, analyzing their effectiveness and adjusting accordingly to maximize profitability.",
      "Utilized excellent communication and leadership skills to ensure smooth operations and high employee engagement."
    ]
  }
]
